Revit 2027 API
SkylightFailures Properties
The BuiltInFailures.SkylightFailures type exposes the following members.
Properties
Name | Description
MinSkylightWidthImperial |  The minimum skylight width is 8 inches.
MinSkylightWidthMetric |  The minimum skylight width is 203.2 millimeters.
Top
See Also
Reference
BuiltInFailures.SkylightFailures Class
Autodesk.Revit.DB Namespace